## Terraform Lint/Plan Results
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.terraform_access: Refreshing state... [id=2ffac8d1a1e85232461425b441d27bce00a220c3]
b2_bucket.terraform-state: Refreshing state... [id=c33185c9297d9b5484380d18]
b2_bucket.tmeit-se-2011-dump: Refreshing state... [id=0351c5e9b99d1b0484480d18]
b2_bucket.db-backups: Refreshing state... [id=531125b9d9ad0bd484480d18]
hcloud_firewall.myfirewall: Refreshing state... [id=572118]
data.cloudflare_api_token_permission_groups.all: Reading...
cloudflare_record.mx-2: Refreshing state... [id=f5173544ebe28b799c113daf0df3e0e5]
cloudflare_record.mx-1: Refreshing state... [id=05ee2ea4ce180da1b784dfd3ade993c3]
cloudflare_zone_settings_override.tmeit-se-settings: Refreshing state... [id=6a806c0199e15cdf23bb3017a90bf149]
data.cloudflare_api_token_permission_groups.all: Read complete after 0s [id=37f58c2e50041f9eed30c0006b111b44]
hcloud_server.node1: Refreshing state... [id=25043683]
cloudflare_api_token.dns_validation_token: Refreshing state... [id=c8a740fd710299e7612975c93125667d]
cloudflare_record.www-aaaa: Refreshing state... [id=9f7b0d63a18b5513abb8db23ce62cd46]
b2_application_key.database-backup: Refreshing state... [id=00331599db448d80000000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # b2_bucket.db-backups will be updated in-place
  ~ resource "b2_bucket" "db-backups" {
        id          = "531125b9d9ad0bd484480d18"
        # (7 unchanged attributes hidden)

      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 365 -> 14
          ~ file_name_prefix              = "tmeit-db-backup-daily" -> "tmeit-db-backup-hourly"
            # (1 unchanged attribute hidden)
        }
      ~ lifecycle_rules {
          ~ days_from_hiding_to_deleting  = 14 -> 365
          ~ file_name_prefix              = "tmeit-db-backup-hourly" -> "tmeit-db-backup-daily"
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # cloudflare_api_token.dns_validation_token will be updated in-place
  ~ resource "cloudflare_api_token" "dns_validation_token" {
        id          = "c8a740fd710299e7612975c93125667d"
        name        = "dns_validation_token2"
        # (4 unchanged attributes hidden)

      ~ condition {
          ~ request_ip {
              ~ in     = [
                  - "2a01:4f9:c012:6063::1/64",
                  - "65.21.188.62/32",
                ] -> (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # cloudflare_record.root-aaaa will be created
  + resource "cloudflare_record" "root-aaaa" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "6a806c0199e15cdf23bb3017a90bf149"
    }

  # cloudflare_record.www-aaaa will be updated in-place
  ~ resource "cloudflare_record" "www-aaaa" {
        id              = "9f7b0d63a18b5513abb8db23ce62cd46"
        name            = "www"
      ~ value           = "2a01:4f9:c012:6063::1" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # hcloud_rdns.node1_ipv4 will be created
  + resource "hcloud_rdns" "node1_ipv4" {
      + dns_ptr    = "tmeit.se"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_rdns.node1_ipv6 will be created
  + resource "hcloud_rdns" "node1_ipv6" {
      + dns_ptr    = "tmeit.se"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_server.node1 is tainted, so must be replaced
-/+ resource "hcloud_server" "node1" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "hel1-dc2" -> (known after apply)
      ~ delete_protection          = false -> true
      ~ id                         = "25043683" -> (known after apply)
      ~ ipv4_address               = "65.21.151.90" -> (known after apply)
      ~ ipv6_address               = "2a01:4f9:c012:4817::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f9:c012:4817::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "node1"
      ~ rebuild_protection         = false -> true
      ~ status                     = "running" -> (known after apply)
        # (9 unchanged attributes hidden)

      - public_net {
          - ipv4         = 0 -> null
          - ipv4_enabled = true -> null
          - ipv6         = 0 -> null
          - ipv6_enabled = true -> null
        }
      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

Plan: 4 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ ipv4_address = "65.21.188.62" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JustinLex, Action: `pull_request`*